#                      1    2    3    4    5    6    7    8    9    0  
#+PROPERTY: Effort_ALL 0:10 0:30 1:00 1:30 2:00 2:30 3:00 4:00 5:00 0
#+COLUMNS: %40ITEM(Task) %1PRIORITY %17Effort(Estimated Effort){:} %CLOCKSUM
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />
 #+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js


* Tickler
** TODO [#A] Weekly review [0%]
SCHEDULED: <2018-01-12 Fri +1w>
:PROPERTIES:
:LAST_REPEAT: [2018-01-05 Fri 16:23]
:Effort:   1:00
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-01-05 Fri 16:23]
- State "DONE"       from "TODO"       [2017-12-29 Fri 15:56]
- State "DONE"       from "TODO"       [2017-11-17 Fri 15:24]
- State "DONE"       from "TODO"       [2017-11-10 Fri 17:05]
- State "DONE"       from "TODO"       [2017-06-16 Fri 15:56]
- State "DONE"       from "TODO"       [2017-04-17 Mon 15:57]
- State "DONE"       from "TODO"       [2017-01-08 Sun 21:27]
- State "DONE"       from "TODO"       [2016-10-31 Mon 15:17]
- State "DONE"       from "TODO"       [2016-08-22 Mon 11:13]
- State "DONE"       from "TODO"       [2016-08-22 Mon 11:13]
- State "DONE"       from "TODO"       [2016-08-22 Mon 11:10]
CLOCK: [2016-08-22 Mon 10:37]--[2016-08-22 Mon 11:10] =>  0:33
CLOCK: [2016-08-22 Mon 10:00]--[2016-08-22 Mon 10:37] =>  0:37
CLOCK: [2016-08-22 Mon 09:54]--[2016-08-22 Mon 09:54] =>  0:00
- State "DONE"       from "TODO"       [2016-08-02 Tue 16:59]
CLOCK: [2016-08-02 Tue 15:30]--[2016-08-02 Tue 16:59] =>  1:29
:END:
- [ ] Paper
  - [ ] Notebook
  - [ ] Backpack
  - [ ] IN
  - [ ] WORKING
- [ ] Photostream
- [ ] Google Keep
- [ ] Evernote (“All Notes” view sorted by date since they don’t always go into INBOX)
- [ ] Desktop/Spaces
- [ ] Browser tabs
- [ ] Calendar
- [ ] Email incl. snoozed
- [ ] Voicemail
- [ ] All tasks
  Say "no" to as much as possible--convert to notes
  If it's TODO, it should be scheduled
*** Dread in the list-of-dread comes from over-commitment, under-planning, and AWOL priorities. :NOTE:
<2017-01-08>
*** The secret sauce isn't input, output, or processing, it's focus :NOTE:
**** The problem with the ever-growing-list-of-doom
***** is that it's ever-growing
***** it becomes paralyzing
***** Rather than a precompiled list of actions it becomes a list of possibilities
****** Which isn't what I want when I'm in execution-mode
***** None of this shit would be a problem if I had my priorities in order
****** (which is exactly what David Allen stresses)
****** (go read--finally!--7 Habits)
**** I can let go of things, if I know they'll be there for me
***** Imagine that the SOMEDAY-MAYBE is actually an index of diary entries
****** Why does everything come back to writing?!
****** And why can I never get myself to write?!?!?!
***** If I can re-visit it, I can elaborate on it
****** Dream to let it rest
****** Evaluate for when to promote
****** And if it won't stay sleeping, then it must be important
**** This seems to imply that the critical part of the Weekly Review is DISPOSITION
***** Say "No" to as much as possible
****** Or find a fulcrum to get it done without effort
******* Outsource Your World
***** Of what's on my action list--what I'm committed to doing!
***** Does this mean that I should be scheduling stuff
If it's going to be done, put it on the calendar? If it's
unscheduled--or if it keeps getting postponed--then decide not to do
it, make it a diary entry?
** TODO Renew MXD passport
SCHEDULED: <2018-11-01 Mon>
expires 04 Apr 2018
** TODO Renew AYD passport
SCHEDULED: <2021-08-01 Sun>
expires 09 Feb 2022
** TODO Renew JXD passport
SCHEDULED: <2020-09-01 Tue>
expires 28 Mar 2021
** TODO Renew CMD passport
SCHEDULED: <2025-09-01 Mon>
expires 27 Mar 2026
* Emacs
** C-x r l ;; list bookmarks                                          :NOTE:

d mark bookmark for deletion
r rename bookmark
s save all listed bookmarks
f show bookmark the cursor is over
m mark bookmarks to be shown in multiple window
v show marked bookmarks (or the one the cursor is over)
t toggle listing of the corresponding paths
w " path to this file
x delete marked bookmarks
q quit bookmark list

** C-c C-z (add a C-z when in tmux) adds a timestamped note in a drawer
:LOGBOOK:
- Note taken on [2016-08-03 Wed 00:51] \\
  Like this!
:END:
** `archive-subtree` is on C-c C-x C-s 

** About emacsclient in tty and cocoa simultaneously                  :NOTE:

[2016-08-10 Wed 16:03]

https://www.reddit.com/r/emacs/comments/22je26/os_x_emacs_in_daemon_mode_and_emacsclient/

* Finance
** Finance armageddon
*** Should I get credit counseling to lower interest rates?
*** Ask /r/ynab how to budget/cashflow for bi-monthly pay
*** YNAB re how to progress towards last-month salary vs. debt service
*** Reddit re: savings vs. snowball
*** Roll snowball into bill chart
** Call Pinnacle for better rates                                    :PHONE:
* Health
** Update expired pills in car first-aid kit
* Rhiza
* Job
** John Arrasjid--how to career plan--want to always do, never want to do, etc.
** Datadog
** Gruntwork
** Pythian
** Talk to USENIX peeps about a job
** Hashicorp
** Talk to PETERSON
** OpenArc
** Aaron Morris
** GEMPERLE
** CASEBEER to push Marc Fox
** What did PETERSON mean by "good storyteller"?
** Red Hat
Ryan Jarvinen <ryanj@redhat.com>
** Taos
** Azure SRE
** LinkedIn
** Nielsen HR
** Heavy Water
** Jeff Senn
** Talk to Tech Ops group (Greg Dumont & Gautham)
** Talk to Gautham about AI
** Gallup Strengths Finder

* Books
** _Wildwood_ series
** Leadership and Self-Desception
** Dweck, _Mindset_
** Pink, _Drive_
** How Buildings Learn
** A Separate Peace
** The American Boy's Handy Book
** The Last Mission
** The Red Badge of Courage
** Watership Down
** Tom Sawyer
** Huck Finn
** Canoeing with the Cree
** The Giver
** Lord of the Flies
** Holes
** The Trumpet of the Swan
** Ender's Game
** The Indian in the Cupboard
** The Black Stallion
** The Cay
** The Thief of Always
** Harvard Business Review
